---
kind: type
id: T:Autodesk.Revit.DB.CurtainGridAlignType
source: html/94295b0a-5660-e259-83b6-f27365ad0dae.htm
---
# Autodesk.Revit.DB.CurtainGridAlignType

An enumerated to list CurtainGrid patterns.

## Syntax (C#)
```csharp
public enum CurtainGridAlignType
```